{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"head-separator":false,"padding_top":28,"padding_bottom":28}},"5c63c061-30f9-4035-8ac2-1959c3c0fd18":{"type":"Faq","blocks":{"7361dd45-e979-489e-9f6a-6ebee220430d":{"type":"text","settings":{"block-head":"Payment","faq-ques":"Do I need to register myself for placing an order online?","faq-answer":"Yes, you need to register yourself on our website in order to place an order. This allows us to provide you with a smooth and hassle-free shopping experience. This will let you easily track your order status, view your order history, and quick checkout for future purchases."}},"68e13446-760b-44df-98df-48e894a3dec7":{"type":"text","settings":{"block-head":"","faq-ques":"What are the acceptable payment methods online?","faq-answer":"We accept all major credit and debit cards, including Visa, Mastercard, and American Express, as well as PayPal and Apple Pay."}},"3f0871f0-678f-4d4c-9907-0f224b29bd14":{"type":"text","settings":{"block-head":"","faq-ques":"Is my payment card data stored in your system?","faq-answer":"No, we do not store any payment card data on our system. All payments are processed securely through our payment gateway provider."}},"4bbdb2be-a92b-45ff-9d2c-8833d019fc1d":{"type":"text","settings":{"block-head":"","faq-ques":"Can I use multiple payment methods for a single order?","faq-answer":"No, we currently do not support using multiple payment methods for a single order."}},"4352279f-2adb-425d-b680-80d71eaca284":{"type":"text","settings":{"block-head":"","faq-ques":"Will I receive a receipt for my payment?","faq-answer":"Yes, you will receive an email confirmation with the receipt of your payment once the order has been placed."}},"5b5cecf6-7f34-4b80-882a-f94dc8dcfb6e":{"type":"text","settings":{"block-head":"","faq-ques":"How long does it take for the payment to be processed?","faq-answer":"Payment processing times may vary depending on the payment method used. Typically, payments made with credit\/debit cards are processed instantly, while payments made through PayPal may take a few minutes to process."}},"547ca367-389f-4a70-983d-ed861f0b75ce":{"type":"text","settings":{"block-head":"","faq-ques":"Is there a refund policy available in case I am not satisfied with my order?","faq-answer":"The nature of our products does not allow us to offer a refund policy. However, in case you are unsatisfied with the product, you can contact our customer care helpdesk.\n<a href=\"mailto:Support@haldiramuk.com\">Support@haldiramuk.com<\/a>"}},"4f3c1a01-17bb-429a-8d6b-5a122879c4f8":{"type":"text","settings":{"block-head":"","faq-ques":"Can I cancel my payment\/order after it has been processed?","faq-answer":"No, once your order has been processed, it cannot be cancelled. If you wish to cancel your order, please contact our customer service team as soon as possible."}},"7efe2e26-779b-4e2d-a848-4de418e25c88":{"type":"text","settings":{"block-head":"","faq-ques":"What happens to my shipment if I'm unavailable to receive it?","faq-answer":"If your parcel is undelivered, DHL Parcel will be redirected to a Service Point from where you can collect the parcel in 5 working days, In the event of non-collection, the parcel will be returned to Haldirams, and a refund will be issued, excluding the £4.99 shipping charges."}},"ea89206e-87d3-4f9c-89f6-e6acdcc1f363":{"type":"text","settings":{"block-head":"Orders","faq-ques":"What is the minimum order amount for your products?","faq-answer":"There is no minimum order amount for our products. You can order as much or as little as you like."}},"241401e5-b644-44c1-82dd-e519d7de5c24":{"type":"text","settings":{"block-head":"","faq-ques":"How do I place an order on your website?","faq-answer":"To place an order on our website, simply browse our products, add items to your cart, and proceed to checkout. You will need to provide your shipping and payment information to complete the order."}},"e2f552bb-637a-4750-b5a5-d840b778a1ba":{"type":"text","settings":{"block-head":"","faq-ques":"Can I modify or cancel my order after it has been placed?","faq-answer":"We cannot guarantee that you will be able to modify or cancel your order after it has been placed, as we strive to process and ship orders as quickly as possible. However, please contact us as soon as possible if you need to make any changes or cancel your order, and we will do our best to accommodate your request."}},"e4061313-bb3d-4f11-a955-3e8e9c0c0377":{"type":"text","settings":{"block-head":"","faq-ques":"How long does it take for my order to be processed and shipped?","faq-answer":"We typically process and ship orders within 1-2 business days. However, shipping times may vary depending on your location and the shipping method you choose at checkout."}},"a3ecf4b3-06f0-4af2-ad80-15295476cd21":{"type":"text","settings":{"block-head":"","faq-ques":"How can I track the status of my order?","faq-answer":"Once your order has been processed and shipped, you will receive a shipping confirmation email with a tracking number. You can use this tracking number to track the status of your order online."}},"775cb3c0-e58c-42ae-a769-8126f8976b23":{"type":"text","settings":{"block-head":"","faq-ques":"How will I know when my order has been shipped?","faq-answer":"You will receive a shipping confirmation email with a tracking number once your order has been shipped. Please note that it may take up to 24 hours for the tracking information to update."}},"4ce47583-2a89-4496-b60c-7aefc5e4510f":{"type":"text","settings":{"block-head":"","faq-ques":"What should I do if there is a problem with my order?","faq-answer":"If you have any problems with your order, please contact us as soon as possible and we will do our best to resolve the issue."}},"643278a3-3d36-433f-9c3d-e75efcf6d866":{"type":"text","settings":{"block-head":"","faq-ques":"What is the return policy, if any?","faq-answer":"The nature of our products does not allow us to offer a return policy."}},"58a2d119-6eb8-40f0-980f-50bded8a2cf3":{"type":"text","settings":{"block-head":"Couriers and Deliveries","faq-ques":"How do I track my order?","faq-answer":"You can track your order by logging into your account on our website and accessing your order history. You will also receive a tracking number via email once your order has been shipped."}},"093cfe9e-2848-4455-89a0-24c695d50939":{"type":"text","settings":{"block-head":"","faq-ques":"What shipping carriers do you use?","faq-answer":"We use a variety of shipping carriers, including Royal Mail, and DHL depending on the destination and shipping speed selected during checkout."}},"6a380335-dc7c-4d81-bb10-e53d83d7f527":{"type":"text","settings":{"block-head":"","faq-ques":"How long will it take to receive my order?","faq-answer":"Delivery times vary depending on the shipping speed selected during checkout and the destination. Typically, orders are delivered within 3-5 business days."}},"7f851429-6520-4e10-aa82-302b22338e28":{"type":"text","settings":{"block-head":"","faq-ques":"Can I change the shipping address for my order?","faq-answer":"If your order has not yet been shipped, you can contact our customer service team to request a shipping address change. However, if the order has already been shipped, we cannot guarantee a change of address."}},"e8c091a7-ff57-4645-b184-f785e7fb9b6a":{"type":"text","settings":{"block-head":"","faq-ques":"What should I do if my order arrives damaged or is missing items?","faq-answer":"If your order arrives damaged or is missing items, please contact our customer service team immediately. We will work with you to resolve the issue and ensure you receive a satisfactory solution."}},"dfd66486-2b6a-4d1d-bb50-ffbdfeedd93a":{"type":"text","settings":{"block-head":"","faq-ques":"What happens if I am not available to take my delivery?","faq-answer":"If you are not available to receive your delivery, the carrier will leave a delivery notice with instructions on how to reschedule or pick up your package."}},"950855f1-1ac6-47ac-acfb-e7e1fa3f9a20":{"type":"text","settings":{"block-head":"","faq-ques":"Can I request a specific delivery date and time?","faq-answer":"Unfortunately, we cannot guarantee a specific delivery date or time. Delivery times are dependent on the shipping carrier's schedule and delivery policies."}},"caade31a-e7f8-4ade-a8c4-85abbdc46547":{"type":"text","settings":{"block-head":"","faq-ques":"Can I change my delivery address after the order has been placed?","faq-answer":"If your order has not yet been shipped, you can contact our customer service team to request a delivery address change. However, if the order has already been shipped, we cannot guarantee a change of address."}},"5c7f0009-adb7-4318-abb4-faff82013dbd":{"type":"text","settings":{"block-head":"Careers","faq-ques":"What types of jobs are available at Haldiram's UK?","faq-answer":"We offer a variety of job opportunities, including positions in manufacturing, distribution, sales, marketing, and administration."}},"3bbfe714-fce4-4270-9c5c-d28820964156":{"type":"text","settings":{"block-head":"","faq-ques":"How do I apply for a job at Haldiram's UK?","faq-answer":"If you wish to apply for a job at Haldiram’s UK, you can check out the career link footer on our website. Once the mailbox opens, you can write a custom message and we will reach out to you."}},"20811fa0-8e0c-483a-9d1a-c7bd6ea9d716":{"type":"text","settings":{"block-head":"","faq-ques":"What are the qualifications required to work at Haldiram's UK?","faq-answer":"The qualifications vary depending on the job. However, we generally look for candidates with relevant education, experience, and skills for the position."}},"f6eef99b-8b92-4dff-8d49-c69b5abdb788":{"type":"text","settings":{"block-head":"","faq-ques":"Does Haldiram's UK offer internships or apprenticeships?","faq-answer":"We currently do not offer Internships or apprenticeships."}},"5529d498-cb69-4069-941f-35115cb97b41":{"type":"text","settings":{"block-head":"","faq-ques":"How long does the recruitment process take at Haldiram's UK?","faq-answer":"The recruitment process duration varies depending on the job and the number of applicants. We will keep you informed about the progress of your application."}},"b5b7d977-f318-4da2-8c33-314915a89e93":{"type":"text","settings":{"block-head":"","faq-ques":"What benefits do employees receive at Haldiram's UK?","faq-answer":"We offer a range of benefits, including competitive pay, health insurance, retirement plans, and opportunities for career development and growth."}},"7cb90a34-7b87-492b-8a30-f71c16ce4864":{"type":"text","settings":{"block-head":"","faq-ques":"Does Haldiram's UK offer training and development programs?","faq-answer":"Yes, we provide training and development programs to help our employees enhance their skills and advance their careers."}},"589fce59-709d-4d0c-b224-dfee4a023f58":{"type":"text","settings":{"block-head":"","faq-ques":"How can I get in touch with Haldiram's UK HR department for career-related queries?","faq-answer":"For career-related queries, you will need to fill out the Contact us form available on the contact us page. Alternatively, you can also reach out to us via mail, just send your CV at <a href=\"mailto:support@haldiramuk.com\">support@haldiramuk.com<\/a>"}},"988059f6-0937-4298-bef8-c81bc41d1567":{"type":"text","settings":{"block-head":"Bulk orders","faq-ques":"What is considered a bulk order for Haldiram's UK?","faq-answer":"Haldiram's UK considers orders of 10 or more items to be bulk orders."}},"9621d08e-9a9e-440a-a3fd-3d2af4bac0a1":{"type":"text","settings":{"block-head":"","faq-ques":"Is there a discount available for bulk orders?","faq-answer":"The discount will be automatically applied to your order on checkout."}},"3b500f63-817c-489e-9331-add023c1ebd9":{"type":"text","settings":{"block-head":"","faq-ques":"How do I place a bulk order with Haldiram's UK?","faq-answer":"In order to place a bulk order, you need to contact us by clicking on the “Bulk Orders” on the header or reach out on <a href=\"mailto:Support@haldiramuk.com\">Support@haldiramuk.com<\/a>"}},"885b05cf-8de8-4222-a965-b3db09165df0":{"type":"text","settings":{"block-head":"","faq-ques":"Is there a minimum order value for bulk orders?","faq-answer":"Yes, the minimum order value for bulk orders is £100."}},"80964fba-fe40-43af-872b-a830919c4685":{"type":"text","settings":{"block-head":"","faq-ques":"Can I customize the items in my bulk order?","faq-answer":"Yes, Haldiram's UK allows customers to customize their bulk orders. Customers can select the items they want and the quantity of each item."}},"6dbe8c7d-5059-4821-9ea9-e4ba0938611c":{"type":"text","settings":{"block-head":"","faq-ques":"How long does it take for a bulk order to be processed and shipped?","faq-answer":"It typically takes 5-7 business days for a bulk order to be processed and shipped."}},"243241de-d39f-4e3c-9448-5c3a77abef15":{"type":"text","settings":{"block-head":"","faq-ques":"Can I cancel or modify my bulk order after it has been placed?","faq-answer":"Changes or cancellations to bulk orders can only be made before the order has been shipped. Once the order has been shipped, it cannot be modified or cancelled."}},"1d664967-7df2-4cbb-a3f5-59f5e63c1780":{"type":"text","settings":{"block-head":"","faq-ques":"What are the payment options available for bulk orders?","faq-answer":"Haldiram's UK accepts payment via bank transfer for bulk orders. The details for making the payment will be provided once the order has been confirmed."}},"027cea9a-a987-4732-868e-4cd6fbe0bc86":{"type":"text","settings":{"block-head":"Return","faq-ques":"What is your return policy?","faq-answer":"As per our policy, we do not accept returns for change of mind or dissatisfaction with the product. We strive to ensure customer satisfaction and provide detailed product information to help you make an informed decision before purchase."}},"420af6bc-8646-4979-b42d-2062a553f28c":{"type":"text","settings":{"block-head":"","faq-ques":"Can I return a product if I changed my mind or it was not what I expected?","faq-answer":"Unfortunately, return is not offered for change of mind or dissatisfaction with the product."}},"531d6744-4d47-4f75-ab38-a8d6f9c460a3":{"type":"text","settings":{"block-head":"","faq-ques":"What is the return policy if  I received the wrong product?","faq-answer":"Please reach out to our customer care in case you have received the wrong product and we shall get you the correct product delivered and pick up the wrong one. If you have consumed or opened the wrong product we may have to charge you for it."}},"a92d3df1-7811-4634-ae23-e62965361e0d":{"type":"text","settings":{"block-head":"","faq-ques":"What do I need to include in my return package?","faq-answer":"All you need to include in the return package is unopened\/damaged product."}},"abbfca6a-f044-4011-bd5b-96b84682cf6e":{"type":"text","settings":{"block-head":"","faq-ques":"Do I need to pay for return shipping?","faq-answer":"Return shipping charges will be incurred by us. You would not need to pay any amount for return shipping."}},"fb26112e-d9e8-4e9f-b970-613ffe721922":{"type":"text","settings":{"block-head":"","faq-ques":"How long does it take to process a return?","faq-answer":"It usually takes up 5 working days to process a refund."}},"10d1567b-0f0d-43a5-8996-72b38d4dce8e":{"type":"text","settings":{"block-head":"","faq-ques":"How will I receive my refund?","faq-answer":"Your refund amount will be credited to the source account with such the order was placed."}},"bf568e43-e4fe-40cb-9034-d72c5dc1b8cb":{"type":"text","settings":{"block-head":"","faq-ques":"What if my product arrives damaged or defective?","faq-answer":"In case you receive a damaged or defective product, kindly reach out to us with pictures of the damaged shipment and we shall arrange a replacement as soon as possible."}}},"block_order":["7361dd45-e979-489e-9f6a-6ebee220430d","68e13446-760b-44df-98df-48e894a3dec7","3f0871f0-678f-4d4c-9907-0f224b29bd14","4bbdb2be-a92b-45ff-9d2c-8833d019fc1d","4352279f-2adb-425d-b680-80d71eaca284","5b5cecf6-7f34-4b80-882a-f94dc8dcfb6e","547ca367-389f-4a70-983d-ed861f0b75ce","4f3c1a01-17bb-429a-8d6b-5a122879c4f8","7efe2e26-779b-4e2d-a848-4de418e25c88","ea89206e-87d3-4f9c-89f6-e6acdcc1f363","241401e5-b644-44c1-82dd-e519d7de5c24","e2f552bb-637a-4750-b5a5-d840b778a1ba","e4061313-bb3d-4f11-a955-3e8e9c0c0377","a3ecf4b3-06f0-4af2-ad80-15295476cd21","775cb3c0-e58c-42ae-a769-8126f8976b23","4ce47583-2a89-4496-b60c-7aefc5e4510f","643278a3-3d36-433f-9c3d-e75efcf6d866","58a2d119-6eb8-40f0-980f-50bded8a2cf3","093cfe9e-2848-4455-89a0-24c695d50939","6a380335-dc7c-4d81-bb10-e53d83d7f527","7f851429-6520-4e10-aa82-302b22338e28","e8c091a7-ff57-4645-b184-f785e7fb9b6a","dfd66486-2b6a-4d1d-bb50-ffbdfeedd93a","950855f1-1ac6-47ac-acfb-e7e1fa3f9a20","caade31a-e7f8-4ade-a8c4-85abbdc46547","5c7f0009-adb7-4318-abb4-faff82013dbd","3bbfe714-fce4-4270-9c5c-d28820964156","20811fa0-8e0c-483a-9d1a-c7bd6ea9d716","f6eef99b-8b92-4dff-8d49-c69b5abdb788","5529d498-cb69-4069-941f-35115cb97b41","b5b7d977-f318-4da2-8c33-314915a89e93","7cb90a34-7b87-492b-8a30-f71c16ce4864","589fce59-709d-4d0c-b224-dfee4a023f58","988059f6-0937-4298-bef8-c81bc41d1567","9621d08e-9a9e-440a-a3fd-3d2af4bac0a1","3b500f63-817c-489e-9331-add023c1ebd9","885b05cf-8de8-4222-a965-b3db09165df0","80964fba-fe40-43af-872b-a830919c4685","6dbe8c7d-5059-4821-9ea9-e4ba0938611c","243241de-d39f-4e3c-9448-5c3a77abef15","1d664967-7df2-4cbb-a3f5-59f5e63c1780","027cea9a-a987-4732-868e-4cd6fbe0bc86","420af6bc-8646-4979-b42d-2062a553f28c","531d6744-4d47-4f75-ab38-a8d6f9c460a3","a92d3df1-7811-4634-ae23-e62965361e0d","abbfca6a-f044-4011-bd5b-96b84682cf6e","fb26112e-d9e8-4e9f-b970-613ffe721922","10d1567b-0f0d-43a5-8996-72b38d4dce8e","bf568e43-e4fe-40cb-9034-d72c5dc1b8cb"],"settings":{}}},"order":["main","5c63c061-30f9-4035-8ac2-1959c3c0fd18"]}